# The dataset (phone_data.csv) contains 830 entries from my mobile phone log spanning a total time of 5 months.

In [1]:
import numpy as na
import pandas as pd

In [2]:
df=pd.read_csv(r"c:\Data Science\Pandas\DataSets&DataFrame\phone_data.csv")

In [3]:
df.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

The main columns in the file are:

1.     date: The date and time of the entry

2.     duration: The duration (in seconds) for each call, the amount of data (in MB) for each data entry, and the number of texts sent (usually 1) for each sms entry.

3.     item: A description of the event occurring – can be one of call, sms, or data.

4.     month: The billing month that each entry belongs to – of form ‘YYYY-MM’.

5.     network: The mobile network that was called/texted for each entry.

6.     network_type: Whether the number being called was a mobile, international (‘world’), voicemail, landline, or other (‘special’) number.

# What was the longest phone call / data entry?

In [4]:
df.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [5]:
df["duration"].max()

10528.0

In [6]:
df[df["duration"]==10528.0]

     index            date  duration  item    month   network network_type
816    816  04/03/15 12:29   10528.0  call  2015-03  landline     landline

# How many seconds of phone calls are recorded in total?

In [7]:
df["duration"][df["item"]=="call"].sum()

92321.0

In [8]:
df['duration'][df.item == 'call'].sum()

92321.0


# How many entries are there for each month?

In [9]:
pd.crosstab(df["month"], df["item"], margins=True)

item     call  data  sms  All
month
2014-11   107    29   94  230
2014-12    79    30   48  157
2015-01    88    31   86  205
2015-02    67    31   39  137
2015-03    47    29   25  101
All       388   150  292  830

In [10]:
df["month"].value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

# Number of non-null unique network entries

In [11]:
df["network"].nunique(dropna=True)

9

In [12]:
df["network"].nunique()

9

In [13]:
df.network.notnull().sum()

830

# Get the first entry for each month

In [14]:
df.groupby("month").head(1)

     index            date  duration  item    month   network network_type
0        0  15/10/14 06:58    34.429  data  2014-11      data         data
228    228  13/11/14 06:58    34.429  data  2014-12      data         data
381    381  13/12/14 06:58    34.429  data  2015-01      data         data
577    577  13/01/15 06:58    34.429  data  2015-02      data         data
729    729  12/02/15 20:15    69.000  call  2015-03  landline     landline

# Get the sum of the durations per month

In [15]:
df.groupby("month")["duration"].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

# Get the number of dates / entries in each month

In [16]:
df.groupby("month").date.count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

# What is the sum of durations, for calls only, to each network

In [17]:
df.groupby(["network", df.item=="call"]).duration.sum()

network    item
Meteor     False       33.00
           True      7200.00
Tesco      False       13.00
           True     13828.00
Three      False       87.00
           True     36464.00
Vodafone   False      149.00
           True     14621.00
data       False     5164.35
landline   True     18433.00
special    False        3.00
voicemail  True      1775.00
world      False        7.00
Name: duration, dtype: float64

In [18]:
df[df["item"]=="call"].groupby("network").duration.sum()

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

# How many calls, sms, and data entries are in each month?

In [19]:
df.groupby("month").item.value_counts()

month    item
2014-11  call    107
         sms      94
         data     29
2014-12  call     79
         sms      48
         data     30
2015-01  call     88
         sms      86
         data     31
2015-02  call     67
         sms      39
         data     31
2015-03  call     47
         data     29
         sms      25
Name: item, dtype: int64

# How many calls, texts, and data are sent per month, split by network_type?

In [20]:
df.groupby(["network_type", "month"]).date.count()

network_type  month
data          2014-11     29
              2014-12     30
              2015-01     31
              2015-02     31
              2015-03     29
landline      2014-11      5
              2014-12      7
              2015-01     11
              2015-02      8
              2015-03     11
mobile        2014-11    189
              2014-12    108
              2015-01    160
              2015-02     90
              2015-03     54
special       2014-11      1
              2015-02      2
voicemail     2014-11      6
              2014-12      8
              2015-01      3
              2015-02      6
              2015-03      4
world         2014-12      4
              2015-03      3
Name: date, dtype: int64

# Group the data frame by month and item and extract a number of stats from each group

In [21]:
df.groupby(["month", "item"]).agg(["max", "min", "mean"])

             index                    duration
               max  min        mean        max     min        mean
month   item
2014-11 call   224    1  102.467290   1940.000   1.000  238.757009
        data   208    0  100.758621     34.429  34.429   34.429000
        sms    230   11  132.457447      1.000   1.000    1.000000
2014-12 call   388  232  312.974684   2120.000   2.000  171.658228
        data   378  228  307.533333     34.429  34.429   34.429000
        sms    371  233  300.229167      1.000   1.000    1.000000
2015-01 call   589  392  489.931818   1859.000   2.000  193.977273
        data   571  381  472.548387     34.429  34.429   34.429000
        sms    593  390  494.139535      1.000   1.000    1.000000
2015-02 call   720  595  656.641791   1863.000   1.000  215.164179
        data   728  577  656.774194     34.429  34.429   34.429000
        sms    726  596  667.769231      1.000   1.000    1.000000
2015-03 call   816  729  773.659574  10528.000   2.000  462.276596
        data   827  731  779.896552     34.429  34.429   34.429000
        sms    829  747  788.000000      1.000   1.000    1.000000

# Define the aggregation procedure outside of the groupby operation

In [22]:
aggregations={
               'duration': ["min", "max", "sum"],
               'network_type': "count",
                "index": ["min", "mean"]
              }

In [25]:
df.groupby(["month", "item"]).agg(aggregations)

             duration                       network_type index
                  min        max        sum        count   min        mean
month   item
2014-11 call    1.000   1940.000  25547.000          107     1  102.467290
        data   34.429     34.429    998.441           29     0  100.758621
        sms     1.000      1.000     94.000           94    11  132.457447
2014-12 call    2.000   2120.000  13561.000           79   232  312.974684
        data   34.429     34.429   1032.870           30   228  307.533333
        sms     1.000      1.000     48.000           48   233  300.229167
2015-01 call    2.000   1859.000  17070.000           88   392  489.931818
        data   34.429     34.429   1067.299           31   381  472.548387
        sms     1.000      1.000     86.000           86   390  494.139535
2015-02 call    1.000   1863.000  14416.000           67   595  656.641791
        data   34.429     34.429   1067.299           31   577  656.774194
        sms     1.000      1.000     39.000           39   596  667.769231
2015-03 call    2.000  10528.000  21727.000           47   729  773.659574
        data   34.429     34.429    998.441           29   731  779.896552
        sms     1.000      1.000     25.000           25   747  788.000000

# Practice again

In [26]:
df=pd.read_csv(r"c:\Data Science\Pandas\DataSets&DataFrame\phone_data.csv")

In [27]:
df.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [28]:
df.duration.max()

10528.0

In [29]:
df.duration[df.item=="call"].sum()

92321.0

In [30]:
df.groupby("month").item.count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: item, dtype: int64

In [31]:
pd.pivot_table(df, index="month", values="item", aggfunc="count", margins=True)

         item
month
2014-11   230
2014-12   157
2015-01   205
2015-02   137
2015-03   101
All       830

In [32]:
pd.crosstab(df["month"], df["item"], margins=True)

item     call  data  sms  All
month
2014-11   107    29   94  230
2014-12    79    30   48  157
2015-01    88    31   86  205
2015-02    67    31   39  137
2015-03    47    29   25  101
All       388   150  292  830

In [33]:
df["network"].notnull().sum()

830

In [34]:
df["network"].nunique()

9

In [35]:
df.groupby("month").head(1)

     index            date  duration  item    month   network network_type
0        0  15/10/14 06:58    34.429  data  2014-11      data         data
228    228  13/11/14 06:58    34.429  data  2014-12      data         data
381    381  13/12/14 06:58    34.429  data  2015-01      data         data
577    577  13/01/15 06:58    34.429  data  2015-02      data         data
729    729  12/02/15 20:15    69.000  call  2015-03  landline     landline

In [36]:
df.groupby("month")["date"]

In [37]:
pd.pivot_table(df, index="month", columns="item", values="date",aggfunc="count", margins=True )

item     call  data  sms  All
month
2014-11   107    29   94  230
2014-12    79    30   48  157
2015-01    88    31   86  205
2015-02    67    31   39  137
2015-03    47    29   25  101
All       388   150  292  830

In [38]:
df.groupby("month").date.count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

In [39]:
df[df["item"]=="call"].pivot_table(index="network",values="duration", aggfunc="sum")

           duration
network
Meteor       7200.0
Tesco       13828.0
Three       36464.0
Vodafone    14621.0
landline    18433.0
voicemail    1775.0

In [40]:
df[df["item"]=="call"].groupby("network").duration.sum()

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

In [41]:
df.groupby("month").item.value_counts()

month    item
2014-11  call    107
         sms      94
         data     29
2014-12  call     79
         sms      48
         data     30
2015-01  call     88
         sms      86
         data     31
2015-02  call     67
         sms      39
         data     31
2015-03  call     47
         data     29
         sms      25
Name: item, dtype: int64

In [42]:
pd.pivot_table(df, index="month", columns="item", values="date",aggfunc="count", margins=True )

item     call  data  sms  All
month
2014-11   107    29   94  230
2014-12    79    30   48  157
2015-01    88    31   86  205
2015-02    67    31   39  137
2015-03    47    29   25  101
All       388   150  292  830

In [43]:
df

     index            date  duration  item    month   network network_type
0        0  15/10/14 06:58    34.429  data  2014-11      data         data
1        1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2        2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3        3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4        4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile
..     ...             ...       ...   ...      ...       ...          ...
825    825  13/03/15 00:38     1.000   sms  2015-03     world        world
826    826  13/03/15 00:39     1.000   sms  2015-03  Vodafone       mobile
827    827  13/03/15 06:58    34.429  data  2015-03      data         data
828    828  14/03/15 00:13     1.000   sms  2015-03     world        world
829    829  14/03/15 00:16     1.000   sms  2015-03     world        world

[830 rows x 7 columns]

In [44]:
df.groupby("network_type").item.value_counts()

network_type  item
data          data    150
landline      call     42
mobile        call    319
              sms     282
special       sms       3
voicemail     call     27
world         sms       7
Name: item, dtype: int64

In [45]:
items_data=df.pivot_table(index="network_type", columns="item", values="duration", aggfunc="count")

In [46]:
items_data.fillna(0, inplace=True)

In [47]:
items_data.astype("int")

item          call  data  sms
network_type
data             0   150    0
landline        42     0    0
mobile         319     0  282
special          0     0    3
voicemail       27     0    0
world            0     0    7

In [48]:
df.groupby(["month", "item"]).agg(["max","min","mean"])

             index                    duration
               max  min        mean        max     min        mean
month   item
2014-11 call   224    1  102.467290   1940.000   1.000  238.757009
        data   208    0  100.758621     34.429  34.429   34.429000
        sms    230   11  132.457447      1.000   1.000    1.000000
2014-12 call   388  232  312.974684   2120.000   2.000  171.658228
        data   378  228  307.533333     34.429  34.429   34.429000
        sms    371  233  300.229167      1.000   1.000    1.000000
2015-01 call   589  392  489.931818   1859.000   2.000  193.977273
        data   571  381  472.548387     34.429  34.429   34.429000
        sms    593  390  494.139535      1.000   1.000    1.000000
2015-02 call   720  595  656.641791   1863.000   1.000  215.164179
        data   728  577  656.774194     34.429  34.429   34.429000
        sms    726  596  667.769231      1.000   1.000    1.000000
2015-03 call   816  729  773.659574  10528.000   2.000  462.276596
        data   827  731  779.896552     34.429  34.429   34.429000
        sms    829  747  788.000000      1.000   1.000    1.000000